
Network Working Group                                        W A Simpson
Internet Draft                                                Daydreamer
expires in six months                                      November 1994


            IPv6 Neighbor Discovery -- ICMP Message Formats
                draft-simpson-ipv6-discov-formats-01.txt                  |



Status of this Memo

   This document is a submission to the IPng Working Group of the
   Internet Engineering Task Force (IETF).  Comments should be submitted
   to the ipng@sunroof.eng.sun.com mailing list.

   Distribution of this memo is unlimited.

   This document is an Internet-Draft.  Internet Drafts are working
   documents of the Internet Engineering Task Force (IETF), its Areas,
   and its Working Groups.  Note that other groups may also distribute
   working documents as Internet Drafts.

   Internet Drafts are draft documents valid for a maximum of six
   months, and may be updated, replaced, or obsoleted by other documents
   at any time.  It is not appropriate to use Internet Drafts as
   reference material, or to cite them other than as a ``working draft''
   or ``work in progress.''

   To learn the current status of any Internet-Draft, please check the
   ``1id-abstracts.txt'' listing contained in the internet-drafts Shadow
   Directories on ds.internic.net (US East Coast), nic.nordu.net
   (Europe), ftp.isi.edu (US West Coast), or munnari.oz.au (Pacific
   Rim).


Abstract

   This document specifies ICMP messages for identification of and        |
   forwarding to adjacent IPv6 nodes, including Mobility, Next Hop        |
   Determination and Router Discovery.










Simpson                  expires in six months                  [Page i]
DRAFT                    IPv6 Discovery Formats            November 1994


1.  Additional ICMP Packets

   The datagram format and basic facilities are already defined for ICMP  |
   as modified for IPv6 [IPv6-ICMP].

   Up-to-date values of the ICMP Type field are specified in the most     |
   recent "Assigned Numbers" [RFC-1700].  This document concerns the
   following values:

       33  Where-Are-You Solicitations
       34  I-Am-Here Advertisements
       35  Mobile Registration Request
       36  Mobile Registration Reply






































Simpson                  expires in six months                  [Page 1]
DRAFT                    IPv6 Discovery Formats            November 1994


1.1.  Where-Are-You Solicitations

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |     Code      |          Checksum             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                            Reserved                           |      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extensions ...
   +-+-+-+-+-+-+-+-+-+-+-+-


   Type              33

   Code             Up-to-date values are specified in the most recent    |
                    "Assigned Numbers" [RFC-1700].  Current values are
                    assigned as follows:

                      0     RESERVED
                      1     General
                      2     Router
                      3     Service (reserved)                            |


   Checksum         The ICMP Checksum.

   Extensions       zero or more Extensions.  This field is variable in   |
                    length.  The Extensions SHOULD be included in the     |
                    order described.  These Extensions are described in   |
                    a later chapter.

   The contents of the Reserved field MUST be zero on transmission, and
   MUST be ignored on receipt.  Future backward-compatible changes to
   the protocol may specify the contents of the Reserved field or of
   additional octets at the end of the message.

















Simpson                  expires in six months                  [Page 2]
DRAFT                    IPv6 Discovery Formats            November 1994


1.1.1.  General Solicitation

   The General Solicitation MUST contain at least the following values:

   Link Header (if any):                                                  |

      Destination      the link equivalent of the Solicited-Nodes IPv6    |
                       Multicast Address.  The mapping is described in    |
                       [IPv6-Address].                                    |

   IPv6 Header:

      Destination      the calculated Solicited-Nodes IPv6 Multicast      |
                       Address.  The scope is intra-link.                 |

                       This is calculated by starting with the            |
                       exclusive-or of each byte of the target IPv6       |
                       Unicast Address, then adding the result to the     |
                       base Solicited-Nodes multicast (FF02::7:0).        |

                       For example, to calculate the destination value    |
                       for target A::B:C, the exclusive-or is E.  The     |
                       calculated destination would be FF02::7:E.

      Source           any IPv6 Unicast Address associated with the       |
                       sending interface.  It MUST NOT contain the
                       Unspecified Address.                               |

      Hop Limit        1

   ICMP fields:

      Code             1 for General Solicitation.

   Extensions:

      Other-Identifier any IPv6 Unicast Address of the target.  The       |
                       Prefix Size and Metric are always zero.            |

      Maximum-Receive-Unit                                                |
                       for interfaces which do not have a fixed hardware  |
                       MTU.

      Media-Access     for interfaces which are not point-to-point
                       links.                                             |

      Node-Heard       for each Router Advertisement that has been
                       heard, in order of preference.



Simpson                  expires in six months                  [Page 3]
DRAFT                    IPv6 Discovery Formats            November 1994


      In the unlikely event that not all extensions fit in a single
      solicitation, as constrained by the MTU of the link, the remaining
      extensions are removed.

   The use of the General Solicitation is described in [D-Send].          |














































Simpson                  expires in six months                  [Page 4]
DRAFT                    IPv6 Discovery Formats            November 1994


1.1.2.  Router Solicitation

   The Router Solicitation MUST contain at least the following values:

   Link Header (if any):                                                  |

      Destination      the link equivalent of the All-Routers IPv6        |
                       Multicast Address.  The mapping is described in    |
                       [IPv6-Address].                                    |

   IPv6 Header:

      Destination      the All-Routers IPv6 Multicast Address (FF02::3).  |
                       The scope is intra-link.

      Source           any IPv6 Unicast Address associated with the       |
                       sending interface.  It MAY contain the
                       Unspecified Address, when the node has not yet     |
                       determined an IPv6 Unicast Address.                |

      Hop Limit        1

   ICMP fields:

      Code             2 for Router Solicitation.                         |

   Extensions:                                                            |

      Maximum-Receive-Unit                                                |
                       for interfaces which do not have a fixed hardware  |
                       MTU.                                               |

      Media-Access     for interfaces which are not point-to-point        |
                       links.

   The use of the Router Solicitation is described in [D-Send].           |















Simpson                  expires in six months                  [Page 5]
DRAFT                    IPv6 Discovery Formats            November 1994


1.2.  I-Am-Here Advertisements                                            |

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |     Code      |          Checksum             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |        Sequence Number        |          LifeTime             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extensions ...
   +-+-+-+-+-+-+-+-+-+-+-+-


   Type              34

   Code             Up-to-date values are specified in the most recent    |
                    "Assigned Numbers" [RFC-1700].  Current values are
                    assigned as follows:

                      0     RESERVED
                      1     General
                      2     Router
                      3     Service (reserved)                            |
                      4     Local Redirect
                      5     Remote Redirect


   Checksum         The ICMP Checksum.

   Sequence Number  the number of Advertisement messages sent since the   |
                    node was initialized.  The value MUST include this    |
                    advertisement.  That is, the first Advertisement
                    contains the value one, and the value zero indicates
                    that the number has rolled over.

   LifeTime         the seconds remaining before the advertised           |
                    information is considered expired.  The maximum time
                    is approximately 18.2 hours.

   Extensions       zero or more Extensions.  This field is variable in   |
                    length.  The Extensions SHOULD be included in the     |
                    order described.  These Extensions are described in   |
                    a later chapter.










Simpson                  expires in six months                  [Page 6]
DRAFT                    IPv6 Discovery Formats            November 1994


1.2.1.  General Advertisement

   The General Advertisement MUST contain at least the following values:

   IPv6 Header:

      Destination      the Source specified in the solicitation, when     |
                       the Source is not the Unspecified Address, the     |
                       node is not serving several clients, and the node  |
                       is not operating as a Mobile Node.                 |

                       Otherwise, the All-Nodes IPv6 Multicast Address    |
                       (FF02::1).  The scope is intra-link.  These        |
                       decisions are described in [D-Send] and            |
                       [Mobility].

      Source           the Destination specified in the solicitation.     |

      Hop Limit        1

   ICMP fields:

      Code             1 for General Advertisement.

      Lifetime         the interface's configured AdvertisementLifetime.

   Extensions:

      Maximum-Receive-Unit                                                |
                       for interfaces which do not have a fixed hardware  |
                       MTU.

      Media-Access     for interfaces which are not point-to-point
                       links.

      Other-Identifier for each of that node's known IPv6 Unicast         |
                       Addresses other than the IPv6 Unicast Address      |
                       specified in the IPv6 Source field.  The Prefix    |
                       Size and Metric are always zero.                   |

                       This supports multiple addresses per interface,    |
                       as well as multi-homed nodes.  This enables the    |
                       recipient node to determine the best next-hop,     |
                       when the next-hop is on another interface          |
                       attached to the same advertising node.             |

      Node-Heard       for the sender of the General Solicitation.        |




Simpson                  expires in six months                  [Page 7]
DRAFT                    IPv6 Discovery Formats            November 1994


                       In addition, each Router Advertisement that has    |
                       been heard, in order of preference.

      In the unlikely event that not all extensions fit in a single
      advertisement, as constrained by the MTU of the link, the
      remaining extensions are removed.

   The use of the General Advertisement is described in [D-Send].         |











































Simpson                  expires in six months                  [Page 8]
DRAFT                    IPv6 Discovery Formats            November 1994


1.2.2.  Router Advertisement

   The Router Advertisement MUST contain at least the following values:

   IPv6 Header:

      Destination      the All-Nodes IPv6 Multicast Address (FF02::1).    |
                       The scope is intra-link.

      Source           the Primary Identifier of the router.              |

                       The same IPv6 Unicast Address is used for all      |
                       interfaces.  When a router has more than one
                       interface on the same link, or a multi-homed host
                       can hear the same router on more than one link,
                       it is necessary to unambiguously know which
                       router sent this advertisement.  The individual    |
                       cluster prefixes for the links are distinguished   |
                       in the Routing-Information extension.              |

      Hop Limit        1

   ICMP fields:

      Code             2 for Router Advertisement.

      Lifetime         the interface's configured AdvertisementLifetime.

   Extensions:

      Hop-Limit        the current Internet Time-To-Live.  Up-to-date     |
                       values are specified in the most recent "Assigned  |
                       Numbers" [RFC-1700].                               |

      Maximum-Receive-Unit                                                |
                       for interfaces which do not have a fixed hardware  |
                       MTU.

      Media-Access     for interfaces which are not point-to-point
                       links.                                             |

      Mobility-Support for interfaces which support Mobile Registration,  |
                       either as a Foreign Agent or Home Agent.           |

                       In the absence of this extension, all routers are  |
                       expected to support decapsulation and forwarding   |
                       from an interface, without explicit registration   |
                       by a Mobile Node.                                  |



Simpson                  expires in six months                  [Page 9]
DRAFT                    IPv6 Discovery Formats            November 1994


      Change-Identifier for each of that interface's IPv6 Unicast or      |
                       Cluster Addresses which has changed from a value   |
                       previously advertised with the Routing-            |
                       Information or Other-Identifier extensions.        |
                       Included at least once, and repeated until the     |
                       original LifeTime expires.

      Routing-Information
                       for each of that interface's associated IPv6       |
                       Unicast Addresses whose Advertise flags are TRUE.  *

      Other-Identifier for each of that node's other IPv6 Unicast or      |
                       Cluster Addresses which have not already been
                       included through prefix subsumption.  This may be  |
                       another address for the same interface, or may     |
                       identify another interface on the same node.       |

                       When a number of interfaces, such as point-to-     |
                       point interfaces, may be aggregated with the same  |
                       prefix, only one extension need be included.       |

      Node-Heard       for each Router Advertisement that has been
                       heard, in order of preference.

      In the unlikely event that not all extensions fit in a single
      advertisement, as constrained by the MTU of the link, multiple
      advertisements are sent, with each containing as many remaining     |
      extensions as can fit.

   The use of the Router Advertisement is described in [D-Send].          |





















Simpson                  expires in six months                 [Page 10]
DRAFT                    IPv6 Discovery Formats            November 1994


1.2.3.  Local Redirect                                                    |

   The Local Redirect MUST contain at least the following values:

   IPv6 Header:

      Destination      the Source specified in the packet being
                       redirected.

      Source           the Primary Identifier of the router.              |

      Hop Limit        1

   ICMP fields:

      Code             4 for Local Redirect.

      Sequence         the last Sequence from the target node
                       Advertisement.

      Lifetime         the remaining Lifetime from the target node
                       Advertisement.

   Extensions:

      Maximum-Receive-Unit                                                |
                       for interfaces which do not have a fixed hardware  |
                       MTU, the Maximum-Receive-Unit extension from the   |
                       target node Advertisement.

      Media-Access     for interfaces which are not point-to-point
                       links, the Media-Access extension from the target
                       node Advertisement.

      Other-Identifier for each IPv6 Unicast or Cluster Address           |
                       associated with the target node.  The Metric is    |
                       always zero.

                       When the redirect applies to an entire cluster,    |
                       the Prefix Size is set to the size of the cluster  |
                       prefix.  This enables the recipient node to        |
                       determine the best next-hop without multiple       |
                       redirects for each cluster.

      Transit-Information
                       one or more, when the redirect is limited to a
                       specific Quality of Service.  The Metric is        |
                       always zero.



Simpson                  expires in six months                 [Page 11]
DRAFT                    IPv6 Discovery Formats            November 1994


      Redirected-Header The target header.

      In the unlikely event that not all extensions fit in a single
      redirect, as constrained by the MTU of the link, the remaining
      extensions are removed.  Only a single redirect is sent.

   The use of the Local Redirect is described in [D-Send].                |












































Simpson                  expires in six months                 [Page 12]
DRAFT                    IPv6 Discovery Formats            November 1994


1.2.4.  Remote Redirect

   The Remote Redirect MUST contain at least the following values:

   IPv6 Header:

      Destination      the Source specified in the packet being
                       redirected.

      Source           the Destination specified in the packet being      |
                       redirected.                                        |

      Hop Limit        from the Router Advertisement.

   An Authentication Header is required.

   ICMP fields:

      Code             5 for Remote Redirect.

      Sequence         the last Sequence from the target node
                       Advertisement.

      Lifetime         the remaining Lifetime from the target node
                       Advertisement.

   Extensions:

      Change-Identifier for each of that interface's IPv6 Unicast or      |
                       Cluster Addresses which is now reached via a       |
                       Care-Of-Address.

      Redirected-Header The target header.

      In the unlikely event that not all extensions fit in a single
      redirect, as constrained by the MTU of the link, the remaining
      extensions are removed.  Only a single redirect is sent.

   The use of the Remote Redirect is described in [Mobility].             |












Simpson                  expires in six months                 [Page 13]
DRAFT                    IPv6 Discovery Formats            November 1994


1.3.  Mobile Registration Request

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |     Code      |          Checksum             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |             unused            |          LifeTime             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   +                         Identification                        +
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   ~                           Home Agent                          ~
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   ~                        Care-Of-Address                        ~
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extensions ...
   +-+-+-+-+-+-+-+-+-+-+-+-

   IPv6 Header:

      Destination      The IPv6 Unicast Address of the Agent, when        |
                       known.

                       Otherwise, the Mobile-Agents IPv6 Multicast        |
                       Address (FF02::11).  The scope is intra-link.      |
                       Examination of the Care-Of-Address is used to
                       deliver the datagram to the correct Agent.

      Source           any IPv6 Unicast Address associated with the       |
                       sending interface.

                       A Mobile Node MUST use the transient Care-Of-
                       Address when assigned; otherwise, the Home-
                       Address is used.

   ICMP fields:

      Type              35                                                |

      Code             Bitmask of optional capabilities:

                         1 - retain prior registrations
                         2 - registering through Foreign Agent




Simpson                  expires in six months                 [Page 14]
DRAFT                    IPv6 Discovery Formats            November 1994


      LifeTime         The seconds remaining before the registration is
                       considered expired.  A value of zero indicates a
                       request for de-registration.  A value of all ones
                       indicates infinity.                                *

      Identification   A sequence number assigned by the Mobile Node.
                       This is used to assist in matching Requests with
                       Replies.

                       A Network Time Protocol [RFC-1305] formatted
                       value is preferred.  The low-order 32 bits of the
                       NTP format represent fractional seconds, and
                       those bits which are not available from a time
                       source SHOULD be generated from a good source of
                       randomness.

                       A battery-backed clock is the usual source of
                       this value.  In more robust implementations,
                       Global Positioning System or authenticated NTP
                       values MAY be used.  The elapsed time since
                       system startup or another such monotonically
                       increasing counter MAY be used, but is considered
                       less secure, as it could repeat each time the
                       machine is restarted, or when a poor source of
                       randomness is used for the low-order bits.  See    |
                       [Eastlake] for a discussion of sources of          |
                       randomness.

                          It is possible to use an entirely random
                          "nonce" in this field, or to generate nonces
                          from previous registration exchanges.  We have
                          not standardized this procedure because of
                          intellectual property concerns.  It is also
                          incompatible with the expected venue of the
                          protocol, and presents difficulties with
                          interoperability and security validation.

                       The value MUST NOT be the same as an immediately
                       preceeding request, and SHOULD NOT repeat during
                       the lifetime of the Mobility Security Association
                       between the Mobile Node and the Home Agent.        |

      Home Agent       The IPv6 Unicast Address of a Home Agent.          |

      Care-Of-Address  The IPv6 Unicast Address for the decapsulation     |
                       end of a tunnel.

   Extensions:



Simpson                  expires in six months                 [Page 15]
DRAFT                    IPv6 Discovery Formats            November 1994


      Other-Identifier the Home-Address of the Mobile Node.  The Metric   |
                       is always zero.                                    |

                       When the request applies to an entire cluster,     |
                       the Prefix Size is set to the size of the cluster  |
                       prefix.                                            |

      Maximum-Receive-Unit                                                |
                       for interfaces which do not have a fixed hardware  |
                       MTU.                                               |

      Media-Access     for interfaces which are not point-to-point        |
                       links.

      Mobile-Home Authentication
                       Immediately follows all non-authentication         *
                       extensions.

   When forwarded by a Foreign Agent, all extensions are copied without   |
   modification.  Those extensions which are specific to the Foreign      |
   Agent are ignored by the Home Agent.                                   |

   The use of the Registration Request is described in [Mobility].




























Simpson                  expires in six months                 [Page 16]
DRAFT                    IPv6 Discovery Formats            November 1994


1.4.  Mobile Registration Reply

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |     Code      |          Checksum             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |             unused            |          LifeTime             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   +                         Identification                        +
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extensions ...
   +-+-+-+-+-+-+-+-+-+-+-+-

   IPv6 Header:

      The Source and Destination of the Request message are swapped for
      the Reply message.

      Note that the Source of the original Mobile Registration Request
      must be saved in order for a Foreign Agent to return the reply to
      the correct Mobile Node.

   ICMP fields:

      Type              36                                                |

      Code             One of the following codes:

                         0  service will be provided.

                       denied by Foreign Agent,
                        16  reason unspecified.
                        17  administratively prohibited.
                        18  insufficient resources.
                        19  Mobile Node failed authentication.
                        20  Home Agent failed authentication.
                        21  Request LifeTime too long.

                       denied by Home Agent,
                        32  reason unspecified.
                        33  administratively prohibited.
                        34  insufficient resources.
                        35  Mobile Node failed authentication.
                        36  Foreign Agent failed authentication.

                       Up-to-date values of the Code field are specified  |
                       in the most recent "Assigned Numbers" [RFC-1700].



Simpson                  expires in six months                 [Page 17]
DRAFT                    IPv6 Discovery Formats            November 1994


      LifeTime         The seconds remaining before the registration is
                       considered expired.  A value of zero confirms a
                       request for de-registration.  A value of all ones
                       indicates infinity.                                |

                       The value MAY be changed by the Home Agent.

      Identification   Copied from the Request message.

   Extensions:

      Other-Identifier the Home-Address of the Mobile Node.  The Metric   |
                       is always zero.                                    |

                       When the reply applies to an entire cluster, the   |
                       Prefix Size is set to the size of the cluster      |
                       prefix.

      Mobile-Home Authentication
                       Immediately follows all non-authentication         *
                       extensions.

                       Note that the Care-Of-Address and Home Agent are
                       not present in the message.  This provides a
                       separate calculation value for mutual
                       authentication.

   When forwarded by a Foreign Agent, all extensions are copied without   |
   modification.  Those extensions which are specific to the Foreign      |
   Agent are ignored by the Home Agent.                                   |

   The use of the Registration Reply is described in [Mobility].



















Simpson                  expires in six months                 [Page 18]
DRAFT                    IPv6 Discovery Formats            November 1994


2.  Extensions

   Extensions allow variable amounts of information to be carried within
   each Solicitation or Advertisement packet.  Some extensions are
   common to both packet types.

   The end of the list of Extensions is indicated by the Payload Length
   of the IPv6 packet.

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |   Extension   |    Length     |    Data ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Extension        This document concerns the following values:

                      0     Single Pad (no length field)
                      1     Multiple Pads (with length field)
                      2     Change-Identifier                             |
                      3     Other-Identifier                              |
                      4     Node-Heard                                    |
                      5     Routing-Information
                      6     Service-Information (reserved)                |
                      7     Transit-Information
                     13     Hop-Limit                                     |
                     14     Maximum-Receive-Unit
                     15     Media-Access
                     16     Mobility-Support                              |
                     17     Home-Address (obsolete)
                     32     Mobile-Home Authentication
                     64     Minimal Encapsulation (obsolete)              |
                     65     GRE Encapsulation
                    254     Redirected-Header                             |

                    Up-to-date values are specified in the most recent    |
                    "Assigned Numbers" [RFC-1700].

   Length           the length of the Data field.  The Length does not    |
                    include the Extension and Length octets.              |

                    The Single Pad (extension 0) is a special case,       |
                    which has neither Length field nor Data field.

   Data             zero or more octets.  The format and length of the    |
                    Data field is determined by the Extension and Length
                    fields.

   When an extension is encountered which is not recognized, it is



Simpson                  expires in six months                 [Page 19]
DRAFT                    IPv6 Discovery Formats            November 1994


   ignored.  The Length field is used to skip the data field in           |
   searching for the next extension.

   Every extension is aligned such that internal fields fall on natural
   boundaries, except that fields larger than 64-bits need only be
   aligned to 64-bit boundaries.

   Any unused portion of the datagram between such Extensions is padded
   as appropriate.  The final Extension in a datagram does not require
   trailing padding.



2.1.  Single Pad

   +-+-+-+-+-+-+-+-+
   |   Extension   |
   +-+-+-+-+-+-+-+-+


   Extension        0



2.2.  Multiple Pads

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |   Extension   |    Length     |   Data ...                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Extension        1

   Length           the length of the Data field.                         |

   Data             zero or more bytes of zeroes.                         |















Simpson                  expires in six months                 [Page 20]
DRAFT                    IPv6 Discovery Formats            November 1994


2.3.  Change-Identifier

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+      *
   |   Extension   |    Length     |        0        | Prefix Size |      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |      *
   ~                           Identifier                          ~      |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Extension        2

   Length           34                                                    |

   Prefix Size      the number of bits in the Identifier which define     |
                    the cluster prefix width for the link.  The value
                    ranges from 0 to 126.                                 |

                    If the Identifier does not indicate a valid prefix,   |
                    the value is zero.                                    |

                    Non-routers MUST set this field to zero.              |

   Identifier       an IPv6 Unicast or Cluster Address.

   For Router Advertisements, gives advance indication that an address    |
   or prefix will no longer be routable.  Applications SHOULD cease to    |
   accept new connections with the old value.  Existing connections       |
   SHOULD issue a Remote Redirect.

   For Remote Redirects, provides a Care-Of-Address to a Correspondent.   |



















Simpson                  expires in six months                 [Page 21]
DRAFT                    IPv6 Discovery Formats            November 1994


2.4.  Other-Identifier

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |        0        | Prefix Size |      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                             Metric                            |      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   ~                           Identifier                          ~      |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Extension        3

   Length           22                                                    |

   Prefix Size      the number of bits in the Identifier which define     |
                    the cluster prefix width for the link.  The value
                    ranges from 0 to 126.

                    If the Identifier does not indicate a valid prefix,   |
                    the value is zero.

                    Non-routers MUST set this field to zero.

   Metric           the preference level for use of this node to forward  |
                    packets to the Identifier.  Lower values indicate
                    greater preference.

                    Non-routers MUST set this field to zero.              |

   Identifier       an IPv6 Unicast or Cluster Address.

   For usage, see the specific message description.                       |
















Simpson                  expires in six months                 [Page 22]
DRAFT                    IPv6 Discovery Formats            November 1994



2.5.  Node-Heard                                                          |

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |        0        | Prefix Size |      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |        Sequence Number        |      Remaining LifeTime       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   ~                       Primary Identifier                      ~      |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              MRU              |       0       |     Speed     |      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                            Quality                            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Advertisement Count                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                          Error Count                          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Extension        4

   Length           38                                                    |

   Prefix Size      the number of bits in the Primary Identifier which    |
                    define the cluster prefix width for the link.  The
                    value ranges from 0 to 126.

                    If the Primary Identifier does not indicate a valid   |
                    prefix, the value is zero.

   Sequence Number  the last heard sequence number from the node.         |

   Remaining LifeTime
                    the seconds remaining before the entry is considered  |
                    expired.                                              |

   Primary Identifier                                                     |
                    the primary IPv6 Unicast or Cluster Address for the   |
                    node, taken from the Source field of the
                    Advertisement heard.

   MRU              the maximum size packet that the node will receive    |
                    over the link.





Simpson                  expires in six months                 [Page 23]
DRAFT                    IPv6 Discovery Formats            November 1994


   Speed            the speed of the link over which the advertisement    |
                    or solicitation was heard.  Higher values indicate
                    greater speed.  The speed value is related to int(
                    10 * ln( speed / 100 ) ) in bits per second.

                      0      link is down
                      1 - 9  reserved
                     10      300 or less
                     24    1,200             96      1,544,000 T1
                     31    2,400             99      2,048,000 E1
                     38    4,800            106      4,000,000 Token Ring
                     42    7,200            110      6,312,000 T2
                     45    9,600            115     10,000,000 Ethernet
                     49   14,400            119     16,000,000 Token Ring
                     52   19,200
                     56   28,800            130     44,736,000 T3
                     59   38,400            142    155,520,000 STS-3,STM-1
                     63   57,600            202    622,080,000 STS-12,STM-4
                     64   64,000            216  2,488,320,000 STS-48,STM-16
                     71  128,000
                     73  153,600
                     78  256,000


   Quality          an indication of the signal quality received from     |
                    this node.  Higher values indicate greater quality.

   Advertisement Count
                    the number of advertisements that have been heard     |
                    from the identified node.

   Error Count      the number of errors which have been detected on the  |
                    link with the identified node.

   This extension is included in an Advertisement message to indicate a   |
   node which has been heard.

   The MRU, Speed, Quality, Advertisement Count, and Error Count are
   primarily used for selecting among multiple paths in a wireless
   environment.











Simpson                  expires in six months                 [Page 24]
DRAFT                    IPv6 Discovery Formats            November 1994


2.6.  Routing-Information

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |  Preference   |C| Prefix Size |      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |      *
   ~                           Identifier                          ~      |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Extension        5

   Length           18                                                    |

   Preference       the preference level for use of this node to forward  |
                    packets having a Source longest match with the        |
                    Identifier.  Higher values indicate greater           |
                    preference.

   C                Cluster bit.  When this bit is set to 1, the IPv6
                    Cluster is entirely confined to the link.  When
                    forwarding, a node MAY use the prefix to determine
                    whether a target node is on the link.                 *

   Prefix Size      the number of bits in the Identifier which define     |
                    the cluster prefix width for the link.  The value
                    ranges from 0 to 126.

                    If the Identifier does not indicate a valid prefix,   |
                    the value is zero.                                    |

   Identifier       one of the IPv6 Unicast or Cluster Addresses for      |
                    this interface.

   This extension is found in Router Advertisements.                      |















Simpson                  expires in six months                 [Page 25]
DRAFT                    IPv6 Discovery Formats            November 1994


2.7.  Transit-Information                                                 |

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |       0       |      QoS      |      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                             Metric                            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Extension        7

   Length           6

   QoS              a quality of service for which transit will be        |
                    accepted.

   Metric           the preference level for use of this link to forward  |
                    packets of the indicated Quality of Service.  Lower
                    values indicate greater preference.

   For redirects, this indicates that the redirect is limited to only     |
   the particular service.  If this extension is not included, the
   redirect includes all services.




























Simpson                  expires in six months                 [Page 26]
DRAFT                    IPv6 Discovery Formats            November 1994


2.8.  Hop-Limit                                                           |

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                      |
   |   Extension   |    Length     |     Hops      |                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                      |


   Extension        13                                                    |

   Length           1                                                     |

   Hops             the currently recommended IPv6 Hop Limit.             |

                    Up-to-date values are specified in the most recent    |
                    "Assigned Numbers" [RFC-1700].




































Simpson                  expires in six months                 [Page 27]
DRAFT                    IPv6 Discovery Formats            November 1994


2.9.  Maximum-Receive-Unit

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |             MRU               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Extension        14

   Length           2

   MRU              the maximum size packet that the node will receive    |
                    over the link.

   This extension MUST be included in those messages sent from an         |
   interface for which there is no dependable MTU, such as Frame-Relay
   or Asynchronous Transfer Mode.

   It MUST NOT be included in messages such as the Remote Redirect which
   pass through intermediate nodes.































Simpson                  expires in six months                 [Page 28]
DRAFT                    IPv6 Discovery Formats            November 1994


2.10.  Media-Access

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |            Family             |      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Media Address ...                                                  |
   +-+-+-+-+-+-+-+-+-+-+-+-


   Extension        15

   Length           >= 2                                                  |

   Family           the Address Family Number.                            |

                    Up-to-date values are specified in the most recent    |
                    "Assigned Numbers" [RFC-1700].

   Media Address    the media address which is used to access this node.  |
                    This field is variable in length.

                    The Media Address is always specified in Canonical
                    order.

   This extension MUST be included in those messages sent from an         |
   interface on a multi-access media.

   It MUST NOT be included in a message sent from a point-to-point
   interface, or in messages such as the Remote Redirect which pass
   through intermediate nodes.





















Simpson                  expires in six months                 [Page 29]
DRAFT                    IPv6 Discovery Formats            November 1994


2.11.  Mobility-Support                                                   |


   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |F|  Reserved   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Extension        16                                                    |

   Length           >= 1                                                  |

   F                Foreign Agent bit.  When this bit is set to 1,        |
                    Mobile Registration through the Foreign Agent is      |
                    required, even when the Mobile Node has acquired a    |
                    transient Care-Of-Address.                            |

   Reserved         Sent as zero; ignored on reception.                   |

   This extension is found in Router Advertisements.                      |































Simpson                  expires in six months                 [Page 30]
DRAFT                    IPv6 Discovery Formats            November 1994


2.12.  Mobile-Home Authentication Extension

                                   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+      |
                                   |   Extension   |    Length     |      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Authenticator ...                                                  |
   +-+-+-+-+-+-+-+-+-+-+-+-                                               |


   Extension        32

   Length           The number of data bytes in the Extension (16 when
                    MD5 is used).

   Authenticator    variable length (128 bits for MD5), 64-bit aligned.   |

                    A hash value taken over a stream of bytes consisting
                    of the shared secret, followed by (concatenated
                    with) the fields in the Mobile Registration message
                    beginning with the Type field, including all prior
                    extensions, and the Type and Length of this
                    extension, but not including the Authenticator field
                    itself.

   This extension is found in all Mobile Registration Requests and        |
   Replies.

   The value differs depending on the direction the message is sent,
   since the Mobile Registration Request and Reply have different
   fields.





















Simpson                  expires in six months                 [Page 31]
DRAFT                    IPv6 Discovery Formats            November 1994


2.13.  GRE Encapsulation Extension                                        |

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Extension        65                                                    |

   Length           0                                                     |

   This extension is found in Router Advertisements and Mobile            |
   Registration Requests.  GRE is described in [RFC-1701].                |






































Simpson                  expires in six months                 [Page 32]
DRAFT                    IPv6 Discovery Formats            November 1994


2.14.  Redirected-Header                                                  |

                                   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                                   |   Extension   |    Length     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   IPv6 Header(s) ...
   +-+-+-+-+-+-+-+-+-+-+-+-


   Extension        254                                                   |

   Length           >= 64                                                 |

   IPv6 Header(s)   variable length, 64-bit aligned.                      |

   This extension is included in the Local or Remote Redirect to verify   |
   the traffic that is being redirected.                                  |


































Simpson                  expires in six months                 [Page 33]
DRAFT                    IPv6 Discovery Formats            November 1994


Security Considerations

   Whenever Ran gets them done.                                           |



References

   [D-Send]                                                               |

   [Eastlake]                                                             |

   [IPv6-Address]

   [IPv6-ICMP]                                                            |

   [Mobility]

   [RFC-1305]                                                             |

   [RFC-1700]                                                             |

   [RFC-1701]



Acknowledgements

   Many thanks to Fred Goldstein, K1IO (DEC, BBN) for his pioneering      |
   work on Radio Shortest Path First (RSPF) for Amateur Packet Radio.     |

   Thanks also for suggestions and contributions from the Simple-IP       |
   Working Group and the Mobile-IP Working Group.                         |

   Special thanks for implementation review by Alex Conta (DEC), Dan      |
   McDonald (Naval Research Laboratory), and Fred Rabouw (Network         |
   Systems Netherlands).



Author's Address

   Questions about this memo can also be directed to:

      William Allen Simpson
      Daydreamer
      Computer Systems Consulting Services
      1384 Fontaine



Simpson                  expires in six months                 [Page 34]
DRAFT                    IPv6 Discovery Formats            November 1994


      Madison Heights, Michigan  48071

      Bill.Simpson@um.cc.umich.edu
          bsimpson@MorningStar.com















































Simpson                  expires in six months                 [Page 35]


